Tekla.Structures.Datatype.AngleList
This class provides methods to handle lists of angles

Tekla.Structures.Datatype.AngleList.ToString(System.Collections.Generic.IEnumerable{Tekla.Structures.Datatype.Angle})
Converts the given angles to a string in the current units
angleList: List of angles to convert
Returns: The angle list as a string

Tekla.Structures.Datatype.AngleList.ToString(System.Collections.Generic.IEnumerable{Tekla.Structures.Datatype.Angle},Tekla.Structures.Datatype.Angle.UnitType)
Converts the given angles to a string in the given units
angleList: List of angles to convert
unitType: Input unit type
Returns: The angle list as a string

Tekla.Structures.Datatype.AngleList.ToString(System.Collections.Generic.IEnumerable{Tekla.Structures.Datatype.Angle},System.String,System.IFormatProvider)
Converts the given angles to a string with the given parameters in the current unit
angleList: List of angles to convert
format: The format string. Can be null.
formatProvider: The number format provider.
Returns: The angle as a string

Tekla.Structures.Datatype.AngleList.ToString(System.Collections.Generic.IEnumerable{Tekla.Structures.Datatype.Angle},System.String,System.IFormatProvider,Tekla.Structures.Datatype.Angle.UnitType)
Converts the given angles to a string with the given parameters in the current unit
angleList: List of angles to convert
format: The format string. Can be null.
formatProvider: The number format provider.
angleUnit: The unit type.
Returns: The angle as a string

Tekla.Structures.Datatype.AngleList.Parse(System.String)
Parses the given text as an angle list in the current unit type
text: Text to parse
Returns: Resulting angle list from the text

Tekla.Structures.Datatype.AngleList.Parse(System.String,System.IFormatProvider)
Parses the given text as an angle list in the current unit type
text: Text to parse
formatProvider: Format provider
Returns: Resulting angle list from the text

Tekla.Structures.Datatype.AngleList.Parse(System.String,System.IFormatProvider,Tekla.Structures.Datatype.Angle.UnitType)
Parses the given text as an angle list in the current unit type
text: Text to parse
formatProvider: Format provider
unitType: Input unit type
Returns: Resulting angle list from the text